tests/loadtest.yml
config:
  target: 'http://localhost:8010'
  phases:
    - duration: 30
      arrivalRate: 100
scenarios:
  - name: "Riders"
    flow:
      - post:
          url: "/rides"
          json:
            start_lat: 1
            start_long: 2
            end_lat: 3
            end_long: 4
            rider_name: "Test"
            driver_name: "Driver"
            driver_vehicle: "vehicle"
          capture:
            json: "$[0].rideID"
            as: "id"
      - get:
          url: "/rides/{{ id }}"
      - get:
          url: "/rides"
          qs:
            page: 1